rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc.c
static inline void Adc_UpdateStatusReadGroupInt(const Adc_GroupType Group,
                                                uint8 UserId)
{
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];

    /* The following code has been added to respect the State Diagram of Streaming Access Mode */
    if (ADC_COMPLETED == Adc_axGroupStatus[Group].Conversion)
    {
        /* SWS_Adc_00331 -- SWS_Adc_00222 */
        Adc_axGroupStatus[Group].Conversion = ADC_BUSY;
    }
    else if (ADC_STREAM_COMPLETED == Adc_axGroupStatus[Group].Conversion)
    {
        /* Compliance with State Diagram */
        if (ADC_TRIGG_SRC_SW == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].TriggerSource)
        {
            if ((ADC_CONV_MODE_ONESHOT == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].Mode)|| \
               ((ADC_CONV_MODE_CONTINUOUS == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].Mode) && \
                (ADC_ACCESS_MODE_STREAMING == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AccessMode) && \
                (ADC_STREAM_BUFFER_LINEAR == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].BufferMode) \
               )
              )
            {
                /* SWS_Adc_00330 - SWS_Adc_00221 */
                Adc_axGroupStatus[Group].Conversion = ADC_IDLE;
            }
            else
            {
                /* Continuous single access or circular streaming buffer mode */
                /* SWS_Adc_00329 -- SWS_Adc_00222 */
                Adc_axGroupStatus[Group].Conversion = ADC_BUSY;
            }
        }
#if (ADC_HW_TRIGGER_API == STD_ON)
        else
        {
            if ((ADC_ACCESS_MODE_STREAMING == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AccessMode)&& \
               (ADC_STREAM_BUFFER_LINEAR == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].BufferMode)
              )
            {
                /* SWS_Adc_00330 - SWS_Adc_00221 */
                Adc_axGroupStatus[Group].Conversion = ADC_IDLE;
            }
            else
            { /* Simple One-shot mode, in other words in single access mode*/
                /* SWS_Adc_00329 -- SWS_Adc_00222 */
                Adc_axGroupStatus[Group].Conversion = ADC_BUSY;
            }
        }
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
    }
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }
}

#endif /* (ADC_READ_GROUP_API == STD_ON) */

#if (ADC_HW_TRIGGER_API == STD_ON)
static inline void Adc_UpdateStatusEnableHardware(Adc_GroupType Group,
                                                  Adc_HwUnitType Unit,
                                                  uint8 UserId)
{
#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
    /* Active CTU trigger state to sync with subsequent calls of "Adc_EnableCTUTrigger" */
    const Adc_GroupType          GroupIndex    = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_HwTriggerTimerType TriggerSource = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].HwTriggerSource;
    uint8 TrigIdx = 0U;

    /* Check if the HW trigger source comes from CTU or BCTU */
    if (TriggerSource <= (Adc_HwTriggerTimerType)ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
    {
        /* Map TriggerSource to TriggerIndex.
           (checking for returned result is not needed, because the "TriggerSource" comes from generated configuration)
         */
        (void)Adc_Ipw_MapCTUTriggerIndex(TriggerSource, UserId, &TrigIdx);
        /* Mark trigger as enabled */
        Adc_au8CtuGroupTriggersActive[Unit][TrigIdx] = 1U;
    }
#else
    (void)UserId;
#endif /* (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) */

    /* Save enabled hardware group ID */
    Adc_axUnitStatus[Unit].OngoingHwGroup = Group;

    /* Mark the Group as BUSY */
    /* SWS_Adc_00222 */
    Adc_axGroupStatus[Group].Conversion = ADC_BUSY;

    /* if HW trigger is enabled for a group, its HW trigger status becomes ENABLED */
    Adc_axGroupStatus[Group].HwTriggering = ADC_HWTRIGGER_ENABLED;

    /* SWS_Adc_00432 */
    /* Put the conversion results from Results Buffer Base Address */
    Adc_axGroupStatus[Group].ResultIndex = 0U;
}

static inline void Adc_UpdateStatusDisableHardware
(
    Adc_GroupType Group,
    Adc_HwUnitType Unit,
    uint8 UserId
)
{
#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
    /* De-active CTU trigger state to sync with subsequent calls of "Adc_EnableCTUTrigger" */
    const Adc_GroupType          GroupIndex    = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_HwTriggerTimerType TriggerSource = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].HwTriggerSource;
    uint8 TrigIdx = 0U;

    /* Check if the HW trigger source comes from CTU or BCTU */
    if (TriggerSource <= (Adc_HwTriggerTimerType)ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
    {
        /* Map TriggerSource to TriggerIndex.
           (checking for returned result is not needed, because the "TriggerSource" comes from generated configuration)
         */
        (void)Adc_Ipw_MapCTUTriggerIndex(TriggerSource, UserId, &TrigIdx);
        /* Mark trigger as disabled */
        Adc_au8CtuGroupTriggersActive[Unit][TrigIdx] = 0U;
    }
#else
    (void)UserId;
#endif /* (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) */


#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    /* [SWS_Adc_00157] If enabled, the function Adc_DisableHardwareTrigger shall disable the notification mechanism for the requested group */
    Adc_axGroupStatus[Group].Notification = ADC_NOTIFICATION_DISABLED;
#endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
#if ((ADC_SETCHANNEL_API == STD_ON) && (ADC_IPW_PDB_AVAILABLE == STD_ON))
     Adc_axRuntimeGroupChannel[Group].RuntimeChanMask = 0xFFFFFFFFUL;
#endif /* ((ADC_SETCHANNEL_API == STD_ON) && (ADC_IPW_PDB_AVAILABLE == STD_ON)) */

    /* SWS_Adc_00361, SWS_Adc_00221 */
    /* Mark the Group status as IDLE */
    Adc_axGroupStatus[Group].Conversion = ADC_IDLE;

    /* Hardware trigger is disabled */
    Adc_axGroupStatus[Group].HwTriggering = ADC_HWTRIGGER_DISABLED;

    /* Remove hardware group ID */
    Adc_axUnitStatus[Unit].OngoingHwGroup = ADC_INVALID_HW_GROUP_ID;

