rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc.c
}
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

/**
* @brief          This function updates the status variables after the getstreamlastpointer operation.
* @details        This function updates the status variables after the getstreamlastpointer operation.
*
* @param[in]      Group       The group of which conversion will be started.
* @param[in]      UserId      Current UserId
*
* @return         void
*
*/
static inline void Adc_UpdateStatusAfterGetStream(Adc_GroupType Group,
                                                  uint8 UserId)
{
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];

    /* The following code has been added to respect the State Diagram of Streaming Access Mode */
    if (ADC_COMPLETED == Adc_axGroupStatus[Group].Conversion)
    {
        /* SWS_Adc_00328 -- SWS_Adc_00222 */
        Adc_axGroupStatus[Group].Conversion = ADC_BUSY;
    }

    if (ADC_STREAM_COMPLETED == Adc_axGroupStatus[Group].Conversion)
    {
        /* Compliance with State Diagram */
        if (ADC_TRIGG_SRC_SW == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].TriggerSource)
        {
            if ((ADC_CONV_MODE_ONESHOT == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].Mode) || \
               ((ADC_CONV_MODE_CONTINUOUS == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].Mode) && \
                (ADC_ACCESS_MODE_STREAMING == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AccessMode) && \
                (ADC_STREAM_BUFFER_LINEAR == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].BufferMode) \
               )
              )
            {
                /* SWS_Adc_00327 -- SWS_Adc_00221 */
                Adc_axGroupStatus[Group].Conversion = ADC_IDLE;
            }
            else
            {
                /* Continuous single access or circular streaming buffer mode */
                /* SWS_Adc_00326 -- SWS_Adc_00222 */
                Adc_axGroupStatus[Group].Conversion = ADC_BUSY;
            }
        }
#if (STD_ON == ADC_HW_TRIGGER_API)
        else
        {
            /* Hw Trigger */
            if ((ADC_ACCESS_MODE_STREAMING == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AccessMode) && \
               (ADC_STREAM_BUFFER_LINEAR == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].BufferMode)
              )
            {
                /* SWS_Adc_00327 -- SWS_Adc_00221 */
                Adc_axGroupStatus[Group].Conversion = ADC_IDLE;
            }
            else
            {
                /* Single access mode or circular streaming buffer mode */
                /* SWS_Adc_00326 -- SWS_Adc_00222 */
                Adc_axGroupStatus[Group].Conversion = ADC_BUSY;
            }
        }
#endif /* (STD_ON == ADC_HW_TRIGGER_API) */
    }
}

#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
#if (ADC_DEV_ERROR_DETECT == STD_ON)

/**
* @brief        This function validates the Adc unit is activated for Ctu control mode.
* @details      This service is a non reentrant function used for validating the Adc unit when
*               Ctu control mode is used.
*
* @param[in]    ServiceId       Service id
* @param[in]    Unit            The Adc logical unit id
* @param[in]    UserId          Current UserId
*
* @return       Std_ReturnType  Standard return type.
* @retval       E_OK:           All checking conditions are valid
* @retval       E_NOT_OK:       ADC Unit is not configured
*/
static inline Std_ReturnType Adc_ValidateUnitActive(uint8 ServiceId,
                                                    Adc_HwUnitType Unit,
                                                    uint8 UserId)
{
    Std_ReturnType Return = (Std_ReturnType)E_OK;

    if (0U == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcUnitSupportCtuControlMode[Unit])
    {
        /* CPR_RTD_00272.adc */
        Adc_ReportDetError(ServiceId, (uint8)ADC_E_PARAM_UNIT);
        Return = (Std_ReturnType)E_NOT_OK;
    }

    return Return;
}
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

/**
* @brief        This function validates the state of ADC unit when the Ctu Control is enabled.
* @details      This service is a non reentrant function used for validating the state of a ADC unit
*               when the ctu control is enabled.
*
* @param[in]    AdcLogicalId            Adc Logical id
*
* @return       Std_ReturnType  Standard return type.
* @retval       E_OK:           The call is valid
* @retval       E_NOT_OK:       The call is not valid
*/
static inline Std_ReturnType Adc_ValidateStateCtuControlMode(uint8 ServiceId,
                                                             Adc_HwUnitType AdcLogicalId)
{
    Std_ReturnType ValidState = (Std_ReturnType)E_OK;

    switch (ServiceId)
    {
        case ADC_ENABLE_CTU_CONTROL_MODE_ID:
        {
            ValidState = Adc_ValidateNotBusyNoQueue(AdcLogicalId, ADC_ENABLE_CTU_CONTROL_MODE_ID);

            /* Check for ongoing conversions */
            if (((Std_ReturnType)E_NOT_OK == ValidState) ||
                (TRUE == Adc_axUnitStatus[AdcLogicalId].CtuControlOngoing)
               )
            {
                /* CPR_RTD_00272.adc */
                ValidState = (Std_ReturnType)E_NOT_OK;
                Adc_ReportDetRuntimeError((uint8)ADC_ENABLE_CTU_CONTROL_MODE_ID, (uint8)ADC_E_BUSY);
            }
            break;
        }
        case ADC_DISABLE_CTU_CONTROL_MODE_ID:
        {
            /* Ctu control mode is already enabled for this Adc unit */
            if (FALSE == Adc_axUnitStatus[AdcLogicalId].CtuControlOngoing)
            {
                /* CPR_RTD_00273.adc */
                ValidState = (Std_ReturnType)E_NOT_OK;
                Adc_ReportDetRuntimeError((uint8)ADC_DISABLE_CTU_CONTROL_MODE_ID, (uint8)ADC_E_IDLE);
            }
            break;
        }
        default:
        {
            ; /* no-op */
            break;
        }
    }
    return ValidState;
}

#if (ADC_DEV_ERROR_DETECT == STD_ON)
static inline Std_ReturnType Adc_ValidateCtuControlModeApi(uint8 CtuLogicalId,
                                                           uint8 ServiceId,
                                                           uint8 UserId)
{
    Std_ReturnType Status = E_OK;
    Adc_HwUnitType AdcLogicalId;
    Adc_HwUnitType AdcPhysicalId;
    boolean CtuControlModeEnabled = FALSE;
    uint8 CtuPhysicalIdEnabled;
    uint8 CtuPhysicalIdExpected;

    if (NULL_PTR == Adc_apxCfgPtr[UserId])
    {
        /* Adc_Init() was not called before */
        Adc_ReportDetError(ServiceId, (uint8)ADC_E_UNINIT);
        Status = E_NOT_OK;
    }
    else
    {
        CtuPhysicalIdExpected = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuLogToPhyId[CtuLogicalId];
        for (AdcLogicalId = 0u; AdcLogicalId < ADC_IPW_MAX_HW_UNITS_CFG; AdcLogicalId++)
        {
            if (TRUE == Adc_axUnitStatus[AdcLogicalId].CtuControlOngoing)
            {
                /* Get CTU Instance corresponding to ADC instance */
                AdcPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[AdcLogicalId];
                CtuPhysicalIdEnabled = Adc_Ipw_AdcPhysicalToCtuPhysical(AdcPhysicalId);
                /* Check if this is the expected Ctu instance */
                if (CtuPhysicalIdEnabled == CtuPhysicalIdExpected)
                {
                    CtuControlModeEnabled = TRUE; /* CtuControl Mode is considered enabled, if it is enabled for at least one AdcHwUnit which associates with that CTU */
                    break;
                }
            }
        }
        /* Raise error if the expected CTU instance is not enabled yet */
        if (FALSE == CtuControlModeEnabled)
        {
            Adc_ReportDetError(ServiceId, (uint8)ADC_E_CONTROL_MODE_DISABLED);
            Status = E_NOT_OK;
        }
    }

