rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc.c
    return Status;
}
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
static inline Std_ReturnType Adc_ValidateCtuControlModeApiByAdcUnit(const Adc_HwUnitType AdcUnit,
                                                                    const uint8 ServiceId,
                                                                    const uint8 UserId)
{
    Std_ReturnType Status = E_OK;
    boolean CtuControlModeEnabled = FALSE;
    Adc_HwUnitType AdcLogicalId;
    uint8 CtuPhysicalIdEnabled;
    uint8 CtuPhysicalIdExpected;

    if (NULL_PTR == Adc_apxCfgPtr[UserId])
    {
        /* Adc_Init() was not called before */
        Adc_ReportDetError(ServiceId, (uint8)ADC_E_UNINIT);
        Status = E_NOT_OK;
    }
    else
    {
        /* Get the expected Ctu instance */
        CtuPhysicalIdExpected = Adc_Ipw_AdcPhysicalToCtuPhysical(Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[AdcUnit]);

        for (AdcLogicalId = 0u; AdcLogicalId < ADC_IPW_MAX_HW_UNITS_CFG; AdcLogicalId++)
        {
            if (TRUE == Adc_axUnitStatus[AdcLogicalId].CtuControlOngoing)
            {
                /* Get CTU Instance corresponding to ADC instance */
                CtuPhysicalIdEnabled = Adc_Ipw_AdcPhysicalToCtuPhysical(Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[AdcLogicalId]);
                /* Check if this is the expected Ctu instance */
                if (CtuPhysicalIdEnabled == CtuPhysicalIdExpected)
                {
                    CtuControlModeEnabled = TRUE; /* CtuControl Mode is considered enabled, if it is enabled for at least one AdcHwUnit which associates with that CTU */
                    break;
                }
            }
        }
        /* Raise error if the expected CTU instance is not enabled yet */
        if (FALSE == CtuControlModeEnabled)
        {
            Adc_ReportDetError(ServiceId, (uint8)ADC_E_CONTROL_MODE_DISABLED);
            Status = E_NOT_OK;
        }
    }

    return Status;
}
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */
static inline Std_ReturnType Adc_ValidateCtuFifoParam(const uint8 ServiceId,
                                                      const uint8 UserId,
                                                      const uint8 CtuLogicalId,
                                                      const Adc_CtuFifoIdxType FifoIdx,
                                                      const uint8 ResultLength)
{
    Std_ReturnType Status = E_OK;
    const uint8_t CtuFifoDepth[ADC_IPW_NUM_CTU_INSTANCES][ADC_IPW_NUM_CTU_FIFO] = ADC_IPW_CTU_FIFO_DEPTH;
    uint8_t CtuHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuLogToPhyId[CtuLogicalId];

    if (FifoIdx >= ADC_IPW_NUM_CTU_FIFO)
    {
        Adc_ReportDetError(ServiceId, ADC_E_PARAM_CONFIG);
        Status = E_NOT_OK;
    }
    else if (CtuFifoDepth[CtuHwUnitId][FifoIdx] < ResultLength)
    {
        Adc_ReportDetError(ServiceId, ADC_E_PARAM_CONFIG);
        Status = E_NOT_OK;
    }
#ifdef ADC_CTU_DMA_SUPPORTED
    else if (TRUE == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->CtuConfigControlMode[CtuLogicalId]->FifoConfigs[FifoIdx].FifoDmaEnable)
    {
        Adc_ReportDetError(ServiceId, ADC_E_DMA_FIFO_TRANSFER);
        Status = E_NOT_OK;
    }
#endif /* ADC_CTU_DMA_SUPPORTED */
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }

#ifndef ADC_CTU_DMA_SUPPORTED
    (void)UserId;
    (void)CtuLogicalId;
#endif /* ADC_CTU_DMA_SUPPORTED */

    return Status;
}
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */

#if (ADC_POWER_STATE_SUPPORTED == STD_ON)
static inline Std_ReturnType Adc_ValidateStateAndPtr(uint8 ServiceId,
                                                     Adc_PowerStateRequestResultType * Result,
                                                     uint8 UserId)
{
    Std_ReturnType RetVal = (Std_ReturnType)E_OK;
    Std_ReturnType ValidUserId = (Std_ReturnType)E_NOT_OK;

    if (NULL_PTR == Result)
    {
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        Adc_ReportDetError(ServiceId, (uint8)ADC_E_PARAM_POINTER);
#else
        (void)ServiceId;
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
        RetVal = (Std_ReturnType)E_NOT_OK;
        (void)ValidUserId;
    }
    else if (NULL_PTR == Adc_apxCfgPtr[UserId])
    {
        /* Adc module is not initialized */
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        /* SWS_Adc_00496, SWS_Adc_00493, SWS_Adc_00491, SWS_Adc_00486 */
        Adc_ReportDetError(ServiceId, (uint8)ADC_E_UNINIT);
#else
        (void)ServiceId;
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

        *Result = ADC_NOT_INIT;
        RetVal = (Std_ReturnType)E_NOT_OK;
        (void)ValidUserId;
    }
    else
    {
        ValidUserId = Adc_CheckCurrentUserId(Adc_apxCfgPtr[UserId], UserId);
        if ((Std_ReturnType)E_NOT_OK == ValidUserId)
        {
#if (ADC_DEV_ERROR_DETECT == STD_ON)
            /* CPR_RTD_00420.adc */
            Adc_ReportDetError(ServiceId, (uint8)ADC_E_PARAM_CONFIG);
#else
            (void)ServiceId;
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

            *Result = ADC_NOT_INIT;
            RetVal = (Std_ReturnType)E_NOT_OK;
        }
    }
    return RetVal;
}

static inline Std_ReturnType Adc_ValidateIdleState(uint8 ServiceId,
                                                   Adc_PowerStateRequestResultType * Result,
                                                   uint8 UserId)
{
    Std_ReturnType RetVal = (Std_ReturnType)E_OK;
    Adc_HwUnitType LogicalHwUnitId;

    for (LogicalHwUnitId = 0U; LogicalHwUnitId < ADC_IPW_MAX_HW_UNITS; LogicalHwUnitId++)
    {
        if (Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcHwUnitArr[LogicalHwUnitId] == (uint8)STD_ON) /* HW unit enabled on current partition */
        {
            if (((Std_ReturnType)E_NOT_OK == Adc_ValidateNotBusyNoQueue(LogicalHwUnitId, ServiceId))
#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
               || (TRUE == Adc_axUnitStatus[LogicalHwUnitId].CtuControlOngoing)
#endif /* if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */
               )
            {
                /* Adc conversion is ongoing */
                /* SWS_Adc_00487 */
                Adc_ReportDetRuntimeError(ServiceId, ADC_E_NOT_DISENGAGED);
                *Result = ADC_SEQUENCE_ERROR;
                RetVal = (Std_ReturnType)E_NOT_OK;
                break;
            }
        }
    }
    return RetVal;
}

