rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc.c
static inline Std_ReturnType Adc_ValidatePowerStateSupport(uint8 ServiceId,
                                                           Adc_PowerStateType ePowerState,
                                                           Adc_PowerStateRequestResultType * Result)
{
    Std_ReturnType RetVal = (Std_ReturnType)E_OK;

    /* If the power state is not supported or low power state is not supported at all */
    if (ePowerState >= ADC_NODEFINE_POWER)
    {
        /* The state is not supported */
        #if (ADC_DEV_ERROR_DETECT == STD_ON)
        Adc_ReportDetError(ServiceId, ADC_E_POWER_STATE_NOT_SUPPORTED);
        #else
        (void)ServiceId;
        #endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

        *Result = ADC_POWER_STATE_NOT_SUPP;
        RetVal = (Std_ReturnType)E_NOT_OK;
    }
    return RetVal;
}

static inline Std_ReturnType Adc_ValidatePowerStatePrepare(uint8 ServiceId,
                                                           Adc_PowerStateRequestResultType * Result,
                                                           uint8 UserId)
{
    Std_ReturnType RetVal = (Std_ReturnType)E_OK;

    /* If the terget state is invalid state */
    if (Adc_aeTargetState[UserId] >= ADC_NODEFINE_POWER)
    {
        /* The target power state is not prepared */
        #if (ADC_DEV_ERROR_DETECT == STD_ON)
        /* SWS_Adc_00490 */
        Adc_ReportDetError(ServiceId, ADC_E_PERIPHERAL_NOT_PREPARED);
        #else
        (void)ServiceId;
        #endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

        *Result = ADC_SEQUENCE_ERROR;
        RetVal = (Std_ReturnType)E_NOT_OK;
    }
    return RetVal;
}
#endif /* (ADC_POWER_STATE_SUPPORTED == STD_ON) */

#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) || defined(__DOXYGEN__)
#if (ADC_DEV_ERROR_DETECT == STD_ON)
/* Validate the Trigger Source */
static inline Std_ReturnType Adc_CheckTriggerSourceRange(uint8 ServiceId,
                                                         Adc_HwTriggerTimerType TriggerSource,
                                                         boolean TriggFound)
{
    Std_ReturnType Status = E_OK;

    if ((TriggerSource > (Adc_HwTriggerTimerType)ADC_IPW_MAX_CTU_TRIG_SOURCE_ID) || (FALSE == TriggFound))
    {
        Adc_ReportDetError(ServiceId, (uint8)ADC_E_WRONG_TRIGG_SRC);
        Status = (Std_ReturnType)E_NOT_OK;
    }

    return Status;
}
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
#endif /* (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) || defined(__DOXYGEN__) */

#if (ADC_SETCHANNEL_API == STD_ON)
#if (ADC_DEV_ERROR_DETECT == STD_ON)
static inline Std_ReturnType Adc_CheckSetChannelParams
(
#if (ADC_IPW_DELAY_AVAILABLE == STD_ON)
    const Adc_GroupType Group,
    const uint16 * Delays,
    const uint32 ChannelUpdateMask,
#endif /* (ADC_IPW_DELAY_AVAILABLE == STD_ON) */
    const Adc_ChannelIndexType NumberOfChannel
)
{
    Std_ReturnType StatusChecks = (Std_ReturnType)E_OK;
#if (ADC_IPW_DELAY_AVAILABLE == STD_ON)
    volatile uint8 UserId = Adc_GetUserID();
    const uint8 UserIdTemp = UserId; /* Used to avoid MISRA */
    const Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
#endif /* (ADC_IPW_DELAY_AVAILABLE == STD_ON) */

    if (0U == NumberOfChannel)
    {
        Adc_ReportDetError(ADC_SETCHANNEL_ID, (uint8)ADC_E_PARAM_CHANNEL);
        StatusChecks = (Std_ReturnType)E_NOT_OK;
    }
#if (ADC_IPW_DELAY_AVAILABLE == STD_ON)
    else if ((0U == ((1UL << (NumberOfChannel - 1U)) & ChannelUpdateMask))
                && (NumberOfChannel != Adc_apxCfgPtr[UserIdTemp]->GroupsPtr[GroupIndex].AssignedChannelCount)
            )
    {
        /* Last channel bit must be enabled for having interrupt */
        Adc_ReportDetError(ADC_SETCHANNEL_ID, (uint8)ADC_E_PARAM_CHANNEL);
    }
    else if (((Std_ReturnType)E_NOT_OK == Adc_ValidatePtr(ADC_SETCHANNEL_ID, Delays))
                && (TRUE == Adc_apxCfgPtr[UserIdTemp]->GroupsPtr[GroupIndex].AdcIpwGroupConfigPtr->AdcGroupEnableChannelDelays)
                && (NumberOfChannel != Adc_apxCfgPtr[UserIdTemp]->GroupsPtr[GroupIndex].AssignedChannelCount)
            )
    {
        /* If NumberOfChannel is different from number already configured, Delays pointer != NULL. */
        Adc_ReportDetError(ADC_SETCHANNEL_ID, (uint8)ADC_E_PARAM_POINTER);
    }
    else if ( \
                ((uint8)STD_ON == Adc_apxCfgPtr[UserIdTemp]->GroupsPtr[GroupIndex].AdcWithoutInterrupt)
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
                || (TRUE == Adc_apxCfgPtr[UserIdTemp]->GroupsPtr[GroupIndex].AdcOptimizeDmaStream)
#endif /* (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */
            )
    {
        /* Number of channels won't be greater than maximum number of SC1 registers */
        if (ADC_MAX_CHAN_COUNT < NumberOfChannel)
        {
            Adc_ReportDetError(ADC_SETCHANNEL_ID, (uint8)ADC_E_PARAM_CHANNEL);
            StatusChecks = (Std_ReturnType)E_NOT_OK;
        }
    }
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_ON)
    else
    {
        /* Number of channels won't be greater than maximum number of SC1 registers */
        if (ADC_MAX_CHAN_COUNT < NumberOfChannel)
        {
            Adc_ReportDetError(ADC_SETCHANNEL_ID, (uint8)ADC_E_PARAM_CHANNEL);
            StatusChecks = (Std_ReturnType)E_NOT_OK;
        }
    }
#else
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_ON) */
#endif /* (ADC_IPW_DELAY_AVAILABLE == STD_ON) */

    return StatusChecks;
}

#if ((ADC_HW_TRIGGER_API == STD_ON) && (ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON))
static inline Std_ReturnType Adc_CheckSetChannelCtuTriggers(const Adc_GroupType GroupIndex,
                                                    #if (ADC_CTU_HW_TRIGGER_OPTIMIZATION == STD_OFF)
                                                            const Adc_GroupDefType *const Channel,
                                                            const Adc_HwUnitType LogicalHwUnitId,
                                                            const Adc_ChannelIndexType NumberOfChannel,
                                                    #endif /* (ADC_CTU_HW_TRIGGER_OPTIMIZATION == STD_OFF) */
                                                            const uint8 UserId)
{
    Std_ReturnType StatusChecks = (Std_ReturnType)E_OK;
#if (ADC_CTU_HW_TRIGGER_OPTIMIZATION == STD_OFF)
    Adc_ChannelType PhysicalChannelId;
    uint32 Index;
#endif /* (ADC_CTU_HW_TRIGGER_OPTIMIZATION == STD_OFF) */

