rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc.c
    UserId = Adc_GetUserID();
#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_CALIBRATE_ID, Unit, UserId))
    {
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
        if ((Std_ReturnType)E_OK == Adc_ValidatePtr(ADC_CALIBRATE_ID, pStatus))
        {
#endif /* ADC_VALIDATE_PARAMS == STD_ON */
            /* Reset status before executing the calibration */
            pStatus->AdcUnitSelfTestStatus = E_NOT_OK;
            if ((Std_ReturnType)E_OK == Adc_ValidateNotBusyNoQueue(Unit, ADC_CALIBRATE_ID))
            {
                if ((Std_ReturnType)E_OK == Adc_ValidateCheckGroupNotConversion(ADC_CALIBRATE_ID, UserId))
                {
                    Adc_Ipw_Calibrate(Unit, pStatus, UserId);
                    IsCalibrateCalled = TRUE;
                }
            }
            if (TRUE == IsCalibrateCalled)
            {
                if ((Std_ReturnType)E_NOT_OK == pStatus->AdcUnitSelfTestStatus)
                {
                    Adc_ReportDetRuntimeError((uint8)ADC_CALIBRATE_ID, (uint8)ADC_E_TIMEOUT);
                }
            }
#if (ADC_VALIDATE_PARAMS == STD_ON)
        }
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    }
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */
}

/** @implements      Adc_SetUserGainAndOffset_Activity */
Std_ReturnType Adc_SetUserGainAndOffset(Adc_HwUnitType Unit,
                                        const Adc_UserGainType Gain,
                                        const Adc_UserOffsetType Offset)
{
    Std_ReturnType ReturnValue = (Std_ReturnType)E_OK;
    const uint8 UserId = Adc_GetUserID();

#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    ReturnValue = Adc_ValidateCallAndUnit(ADC_SET_USER_GAIN_AND_OFFSET_ID, Unit, UserId);
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */

    if ((Std_ReturnType)E_OK == ReturnValue)
    {
        ReturnValue = Adc_Ipw_SetUserGainAndOffset(Unit, UserId, Gain, Offset);
    }

    return ReturnValue;
}

#endif /* ADC_CALIBRATION == STD_ON */

#if (ADC_APPLY_CALIBRATION == STD_ON)
/** @implements      Adc_ApplyCalibration_Activity */
Std_ReturnType Adc_ApplyCalibration(Adc_HwUnitType Unit,
                                    const uint32 BufferLength,
                                    const sint16 * const UncalibratedBuffer,
                                    sint16 * const CalibratedBuffer)
{
    Std_ReturnType ReturnValue = (Std_ReturnType)E_OK;
    const uint8 UserId = Adc_GetUserID();

#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    ReturnValue = Adc_ValidateCallAndUnit(ADC_APPLY_CALIBRATION_ID, Unit, UserId);
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
    if ((Std_ReturnType)E_OK == ReturnValue)
    {
        ReturnValue = Adc_ValidatePtr(ADC_APPLY_CALIBRATION_ID, UncalibratedBuffer);
    }

    if ((Std_ReturnType)E_OK == ReturnValue)
    {
        ReturnValue = Adc_ValidatePtr(ADC_APPLY_CALIBRATION_ID, CalibratedBuffer);
    }
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

    if ((Std_ReturnType)E_OK == ReturnValue)
    {
        ReturnValue = Adc_Ipw_ApplyCalibration(Unit, UserId, BufferLength, UncalibratedBuffer, CalibratedBuffer);
    }

    return ReturnValue;
}
#endif /* ADC_APPLY_CALIBRATION == STD_ON */

#if (ADC_SELF_TEST == STD_ON)
/** @implements      Adc_SelfTest_Activity */
Std_ReturnType Adc_SelfTest(Adc_HwUnitType Unit)
{
    volatile uint8 UserId;
    Std_ReturnType ReturnValue = (Std_ReturnType)E_NOT_OK;

    UserId = Adc_GetUserID();
#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_SELFTEST_ID , Unit, UserId))
    {
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */

        ReturnValue = Adc_Ipw_SelfTest(Unit, UserId);
        if ((Std_ReturnType)E_NOT_OK == ReturnValue)
        {
            Adc_ReportDetRuntimeError((uint8)ADC_SELFTEST_ID, (uint8)ADC_E_TIMEOUT);
        }
#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    }
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */
    return ReturnValue;
}
#endif

#if (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON)
void Adc_ConfigureThreshold(Adc_ThresholdControlIndexType ThresholdControlIndex,
                            Adc_WdgThresholdValueType LowValue,
                            Adc_WdgThresholdValueType HighValue)
{
    const uint8 UserId = Adc_GetUserID();
    Std_ReturnType Status;

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const Adc_HwUnitType LogicalHwUnitId = (uint8)(ThresholdControlIndex >> ADC_THRESHOLD_SYMBOLIC_NAME_SHIFT_HW_UNIT_ID_U16);

    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_CONFIGURE_THRESHOLD_ID, LogicalHwUnitId, UserId))
    {
#endif /* if (ADC_DEV_ERROR_DETECT == STD_ON) */

        Status = Adc_Ipw_ConfigureThreshold(ThresholdControlIndex, LowValue, HighValue, UserId);

#if (ADC_DEV_ERROR_DETECT == STD_ON)
        if ((Std_ReturnType)E_NOT_OK == Status)
        {
            Adc_ReportDetError((uint8)ADC_CONFIGURE_THRESHOLD_ID, (uint8)ADC_E_WRONG_CONF_THRHLD_VALUE);
        }
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

    (void)Status;
}
#endif /* ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON */

#ifdef ADC_WDG_SUPPORTED
/* CPR_RTD_00449.adc */
void Adc_EnableWdgNotification(Adc_ChannelType ChannelId)
{
    /* Extract unit id information */
    const uint8 UserId = Adc_GetUserID();
    const Adc_HwUnitType LogicalHwUnitId = (Adc_HwUnitType)(ChannelId >> ADC_CHANNEL_SYMBOLIC_NAME_SHIFT_HW_UNIT_ID_U16);
    Std_ReturnType Status;

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_ENABLEWDGNOTIFICATION_ID, LogicalHwUnitId, UserId))
    {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

        Status = Adc_Ipw_EnableWdgNotification(LogicalHwUnitId, ChannelId, UserId);

#if (ADC_DEV_ERROR_DETECT == STD_ON)
        if ((Std_ReturnType)E_NOT_OK == Status)
        {
            Adc_ReportDetError((uint8)ADC_ENABLEWDGNOTIFICATION_ID, (uint8)ADC_E_PARAM_CONFIG);
        }
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

    (void)Status;
}

/* CPR_RTD_00451.adc */
void Adc_DisableWdgNotification(Adc_ChannelType ChannelId)
{
    /* Extract unit id information */
    const uint8 UserId = Adc_GetUserID();
    const Adc_HwUnitType LogicalHwUnitId = (Adc_HwUnitType)(ChannelId >> ADC_CHANNEL_SYMBOLIC_NAME_SHIFT_HW_UNIT_ID_U16);
    Std_ReturnType Status;

