rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc.c
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_DISABLEWDGNOTIFICATION_ID, LogicalHwUnitId, UserId))
    {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

        Status = Adc_Ipw_DisableWdgNotification(LogicalHwUnitId, ChannelId, UserId);

#if (ADC_DEV_ERROR_DETECT == STD_ON)
        if ((Std_ReturnType)E_NOT_OK == Status)
        {
            Adc_ReportDetError((uint8)ADC_DISABLEWDGNOTIFICATION_ID, (uint8)ADC_E_PARAM_CONFIG);
        }
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

    (void)Status;
}
#endif /* ADC_WDG_SUPPORTED */

#if (ADC_DUAL_CLOCK_MODE == STD_ON)
/* CPR_RTD_00044.adc */
/** @implements      Adc_SetClockMode_Activity */
Std_ReturnType Adc_SetClockMode(Adc_SelectPrescalerType Prescaler)
{
    volatile uint8 UserId;
    Std_ReturnType Ret = (Std_ReturnType)E_NOT_OK;
    Adc_HwUnitType LogicalHwUnitId;
    Std_ReturnType ErrorFound = (Std_ReturnType)E_OK;
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    uint8 UserIdTemp;
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */

    UserId = Adc_GetUserID();
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    UserIdTemp = UserId; /* Used to avoid MISRA */
    if (TRUE == Adc_CheckSetClockModeCoreAndParam(Prescaler, UserIdTemp))
    {
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
        for (LogicalHwUnitId = 0U; LogicalHwUnitId < ADC_IPW_MAX_HW_UNITS; LogicalHwUnitId++)
        {
            /* HW unit enabled on current partition */
            if (Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcHwUnitArr[LogicalHwUnitId] == (uint8)STD_ON)
            {
                ErrorFound = Adc_ValidateNotBusyNoQueue(LogicalHwUnitId, ADC_SETCLOCKMODE_ID);
                if ((Std_ReturnType)E_NOT_OK == ErrorFound)
                {
                    break;
                }
            }
        }
        if ((Std_ReturnType)E_OK == ErrorFound)
        {
            if ((Std_ReturnType)E_OK == Adc_ValidateCheckGroupNotConversion(ADC_SETCLOCKMODE_ID, UserId))
            {

                Ret = Adc_Ipw_SetClockMode(Prescaler, UserId);
#if (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)
                Adc_aeClockMode[UserId] = Prescaler;
#endif
            }
        }
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    }
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
    return Ret;
}
#endif /* (ADC_DUAL_CLOCK_MODE == STD_ON) */

#if (ADC_CTU_CONTROL_MODE_EXTRA_APIS == STD_ON)
/* CPR_RTD_00056.adc */
/** @implements      Adc_CtuWriteTriggerEnableMask_Activity */
Std_ReturnType Adc_CtuWriteTriggerEnableMask(Adc_CtuTrigSrcType Trigger,
                                             uint8 ThcrValue)
{
    Std_ReturnType Ret = (Std_ReturnType)E_OK;
    const uint8 CtuLogicalId = (uint8)((Trigger & ADC_IPW_CTU_LOGICAL_ID_MASK_U16) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT_U16);
    const uint8 TriggerId = (uint8)(Trigger & ~(ADC_IPW_CTU_LOGICAL_ID_MASK_U16));

    volatile uint8 UserId = Adc_GetUserID();

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    Ret = Adc_ValidateCallAndTrigger(ADC_CTU_SET_WRITE_TRIG_EN_MASK_ID, TriggerId, CtuLogicalId, UserId);
    if ((Std_ReturnType)E_OK == Ret)
#endif
    {
        Adc_Ipw_SetCtuWriteTriggerEnableMask(CtuLogicalId, TriggerId, ThcrValue, UserId);
    }
    return Ret;
}

/* CPR_RTD_00059.adc */
/** @implements      Adc_CtuSetTriggerEnable_Activity */
Std_ReturnType Adc_CtuSetTriggerEnable(Adc_CtuTrigSrcType Trigger,
                                       boolean Enable)
{
    Std_ReturnType Ret = (Std_ReturnType)E_OK;
    const uint8 CtuLogicalId = (uint8)((Trigger & ADC_IPW_CTU_LOGICAL_ID_MASK_U16) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT_U16);
    const uint8 TriggerId = (uint8)(Trigger & ~(ADC_IPW_CTU_LOGICAL_ID_MASK_U16));

    volatile uint8 UserId = Adc_GetUserID();

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    Ret = Adc_ValidateCallAndTrigger(ADC_CTU_SET_TRIGGER_ENABLE_ID, TriggerId, CtuLogicalId, UserId);
    if ((Std_ReturnType)E_OK == Ret)
#endif
    {
        Adc_Ipw_CtuSetTriggerEnable(CtuLogicalId, TriggerId, Enable, UserId);
    }
    return Ret;
}

/* CPR_RTD_00057.adc */
/** @implements      Adc_CtuSetTriggerAdcCmdAddress_Activity */
Std_ReturnType Adc_CtuSetTriggerAdcCmdAddress(Adc_CtuTrigSrcType Trigger,
                                              uint8 ClcrValue)
{
    Std_ReturnType Ret = (Std_ReturnType)E_OK;
    const uint8 CtuLogicalId = (uint8)((Trigger & ADC_IPW_CTU_LOGICAL_ID_MASK_U16) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT_U16);
    const uint8 TriggerId = (uint8)(Trigger & ~(ADC_IPW_CTU_LOGICAL_ID_MASK_U16));

    volatile uint8 UserId = Adc_GetUserID();

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    Ret = Adc_ValidateCallAndTrigger(ADC_CTU_SET_TRIGGER_ADC_CMD_ADDRESS_ID, TriggerId, CtuLogicalId, UserId);
    if ((Std_ReturnType)E_OK == Ret)
    {
        if ((uint32)ClcrValue > 24u)
        {
            Adc_ReportDetError(ADC_CTU_SET_TRIGGER_ADC_CMD_ADDRESS_ID, ADC_E_WRONG_CTU_CLCR_TRIGGER);
            Ret = (Std_ReturnType)E_NOT_OK;
        }
    }
    if ((Std_ReturnType)E_OK == Ret)
#endif
    {
        Adc_Ipw_SetCtuTrigAdcCmd(CtuLogicalId, TriggerId, ClcrValue, UserId);
    }
    return Ret;
}

/* CPR_RTD_00058.adc */
/** @implements      Adc_CtuSetTriggerCompare_Activity */
Std_ReturnType Adc_CtuSetTriggerCompare(Adc_CtuTrigSrcType Trigger,
                                        uint16 CompareValue)
{
    Std_ReturnType Ret = (Std_ReturnType)E_OK;
    const uint8 CtuLogicalId = (uint8)((Trigger & ADC_IPW_CTU_LOGICAL_ID_MASK_U16) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT_U16);
    const uint8 TriggerId = (uint8)(Trigger & ~(ADC_IPW_CTU_LOGICAL_ID_MASK_U16));

    volatile uint8 UserId = Adc_GetUserID();

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    Ret = Adc_ValidateCallAndTrigger(ADC_CTU_SET_TRIGGER_COMPARE_ID, TriggerId, CtuLogicalId, UserId);
    if ((Std_ReturnType)E_OK == Ret)
#endif
    {
        Adc_Ipw_SetCtuTriggerCompare(CtuLogicalId, TriggerId, CompareValue, UserId);
    }
    return Ret;
}
#endif /* if (ADC_CTU_CONTROL_MODE_EXTRA_APIS == STD_ON)  */

#if (ADC_SETCHANNEL_API == STD_ON)
/** @implements      Adc_SetChannel_Activity */
void Adc_SetChannel(Adc_GroupType Group,
                    const Adc_GroupDefType * Channel,
#if (ADC_IPW_DELAY_AVAILABLE == STD_ON)
                    const uint16 * Delays,
                    uint32 ChannelUpdateMask,
#endif /* (ADC_IPW_DELAY_AVAILABLE == STD_ON) */
                    Adc_ChannelIndexType NumberOfChannel)
{
#if ((ADC_DEV_ERROR_DETECT == STD_ON) || (ADC_ENABLE_LIMIT_CHECK == STD_ON))
    volatile uint8 UserId = Adc_GetUserID();
    Adc_HwUnitType LogicalHwUnitId = 0U;
    Adc_GroupType GroupIndex = 0U;
#endif /* ((ADC_DEV_ERROR_DETECT == STD_ON) || (ADC_ENABLE_LIMIT_CHECK == STD_ON)) */
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    uint8 UserIdTemp = UserId; /* Used to avoid MISRA */
    uint32 Index = 0u;
    Std_ReturnType StatusChecks = Adc_ValidateCallAndGroup(ADC_SETCHANNEL_ID, Group, UserId);

