rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc.c
    if (StatusChecks == (Std_ReturnType)E_OK)
    {
        GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
        LogicalHwUnitId = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AdcLogicalUnitId;
        if ((Std_ReturnType)E_OK == Adc_ValidatePtr(ADC_SETCHANNEL_ID, Channel))
        {
#if (ADC_IPW_DELAY_AVAILABLE == STD_ON)
            StatusChecks = Adc_CheckSetChannelParams(Group, Delays, ChannelUpdateMask, NumberOfChannel);
#else
            StatusChecks = Adc_CheckSetChannelParams(NumberOfChannel);
#endif /* (ADC_IPW_DELAY_AVAILABLE == STD_ON) */

            for (Index = 0; Index < NumberOfChannel; Index++)
            {
                /* Check if input channel is configured at initialization */
                if (
                    (Channel[Index] >= Adc_apxCfgPtr[UserIdTemp]->AdcIpwConfigPtr->Mapping.AdcChannels[LogicalHwUnitId])
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
                    || ((NumberOfChannel > 1U) &&
#if ((ADC_IPW_BCTU_AVAILABLE == STD_ON) || (ADC_IPW_CTU_AVAILABLE == STD_ON))
                        (TRUE == Adc_apxCfgPtr[UserIdTemp]->AdcIpwConfigPtr->AdcIpwChannelConfig[LogicalHwUnitId][Channel[Index]].ChannelLimitCheckingConfig.ChannelLimitCheckEnabled)
#else
                        (TRUE == Adc_apxCfgPtr[UserIdTemp]->AdcIpwConfigPtr->ChannelLimitCheckingConfigs[LogicalHwUnitId][Channel[Index]].ChannelLimitCheckEnabled)
#endif /*((ADC_IPW_BCTU_AVAILABLE == STD_ON) || (ADC_IPW_CTU_AVAILABLE == STD_ON)) */
                       )
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
                   )
                {
                    Adc_ReportDetError(ADC_SETCHANNEL_ID, (uint8)ADC_E_PARAM_CHANNEL);
                    StatusChecks = (Std_ReturnType)E_NOT_OK;
                    break;
                }
            }
        }
    }

#if ((ADC_HW_TRIGGER_API == STD_ON) && (ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON))
    if (StatusChecks == (Std_ReturnType)E_OK)
    {
#if (ADC_CTU_HW_TRIGGER_OPTIMIZATION == STD_OFF)
        StatusChecks = Adc_CheckSetChannelCtuTriggers(GroupIndex, Channel, LogicalHwUnitId, NumberOfChannel, UserId);
#else
        StatusChecks = Adc_CheckSetChannelCtuTriggers(GroupIndex, UserId);
#endif /* (ADC_CTU_HW_TRIGGER_OPTIMIZATION == STD_OFF) */
    }
#endif /* ((ADC_HW_TRIGGER_API == STD_ON) && (ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON)) */

    if (StatusChecks == (Std_ReturnType)E_OK)
    {
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
        Adc_axRuntimeGroupChannel[Group].ChannelPtr = Channel;
        Adc_axRuntimeGroupChannel[Group].ChannelCount = NumberOfChannel;
        Adc_axRuntimeGroupChannel[Group].RuntimeUpdated = TRUE;
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
#if (ADC_DEV_ERROR_DETECT == STD_OFF)
        GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
        LogicalHwUnitId = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AdcLogicalUnitId;
#endif /* (ADC_DEV_ERROR_DETECT == STD_OFF) */
#if ((ADC_IPW_BCTU_AVAILABLE == STD_ON) || (ADC_IPW_CTU_AVAILABLE == STD_ON))
        Adc_axRuntimeGroupChannel[Group].AdcRuntimeGroupLimitcheck = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcIpwChannelConfig[LogicalHwUnitId][Channel[0U]].ChannelLimitCheckingConfig.ChannelLimitCheckEnabled;
#else
        Adc_axRuntimeGroupChannel[Group].AdcRuntimeGroupLimitcheck = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->ChannelLimitCheckingConfigs[LogicalHwUnitId][Channel[0U]].ChannelLimitCheckEnabled;
#endif /* ((ADC_IPW_BCTU_AVAILABLE == STD_ON) || (ADC_IPW_CTU_AVAILABLE == STD_ON)) */
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
#if (ADC_IPW_DELAY_AVAILABLE == STD_ON)
        Adc_axRuntimeGroupChannel[Group].DelaysPtr = Delays;
        if (NumberOfChannel <= ADC_MAX_CHAN_COUNT)
        {
            Adc_axRuntimeGroupChannel[Group].RuntimeChanMask = ChannelUpdateMask;
        }
        else
        {
            Adc_axRuntimeGroupChannel[Group].RuntimeChanMask = 0xFFFFFFFFUL;
        }
#endif /* (ADC_IPW_DELAY_AVAILABLE == STD_ON) */
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    }
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
}
#endif /* ADC_SETCHANNEL_API == STD_ON */

#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
/* CPR_RTD_00271.adc */
/** @implements      Adc_EnableCtuControlMode_Activity */
void Adc_EnableCtuControlMode(Adc_HwUnitType Unit)
{
    volatile uint8 UserId = Adc_GetUserID();

#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_ENABLE_CTU_CONTROL_MODE_ID, Unit, UserId))
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    {
        if ((Std_ReturnType)E_OK == Adc_ValidateUnitActive(ADC_ENABLE_CTU_CONTROL_MODE_ID, Unit, UserId))
        {
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
            if ((Std_ReturnType)E_OK == Adc_ValidateStateCtuControlMode(ADC_ENABLE_CTU_CONTROL_MODE_ID, Unit))
            {
                if ((Std_ReturnType)E_NOT_OK == Adc_Ipw_EnableCtuControlMode(Unit, UserId))
                {
#if (ADC_DEV_ERROR_DETECT == STD_ON)
                    Adc_ReportDetError(ADC_ENABLE_CTU_CONTROL_MODE_ID, (uint8)ADC_E_PARAM_UNIT);
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
                }
            }
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        }
    }
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
}

/* CPR_RTD_00271.adc */
/** @implements      Adc_DisableCtuControlMode_Activity */
void Adc_DisableCtuControlMode(Adc_HwUnitType Unit)
{
    volatile uint8 UserId = Adc_GetUserID();

#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_DISABLE_CTU_CONTROL_MODE_ID, Unit, UserId))
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    {
        if ((Std_ReturnType)E_OK == Adc_ValidateUnitActive(ADC_DISABLE_CTU_CONTROL_MODE_ID, Unit, UserId))
        {
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
            if ((Std_ReturnType)E_OK == Adc_ValidateStateCtuControlMode(ADC_DISABLE_CTU_CONTROL_MODE_ID, Unit))
            {
                Adc_Ipw_DisableCtuControlMode(Unit, UserId);
            }
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        }
    }
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
}

/* CPR_RTD_00455.adc */
/** @implements      Adc_CtuEnableHwTrigger_Activity */
void Adc_CtuEnableHwTrigger(Adc_CtuTrigSrcType TrigSource)
{
    const uint8 CtuLogicalId = (uint8)((TrigSource & ADC_IPW_CTU_LOGICAL_ID_MASK_U16) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT_U16);
    const uint8 TriggerId = (uint8)(TrigSource & ~(ADC_IPW_CTU_LOGICAL_ID_MASK_U16));
    uint8 UserId = Adc_GetUserID();

