rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc.c
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_ENABLE_HW_TRIGGER_ID;

    if (Adc_ValidateCtuControlModeApi(CtuLogicalId, ServiceId, UserId) == (Std_ReturnType)E_OK)
    {
        if (TriggerId > ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
        {
            Adc_ReportDetError(ServiceId, ADC_E_WRONG_TRIGG_SRC);
        }
        else
        {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

            Adc_Ipw_CtuEnableHwTrigger(CtuLogicalId, (uint8)TriggerId, UserId);

#if (ADC_DEV_ERROR_DETECT == STD_ON)
        }
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
}

/** @implements      Adc_CtuDisableHwTrigger_Activity */
void Adc_CtuDisableHwTrigger(Adc_CtuTrigSrcType TrigSource)
{
    const uint8 CtuLogicalId = (uint8)((TrigSource & ADC_IPW_CTU_LOGICAL_ID_MASK_U16) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT_U16);
    const uint8 TriggerId = (uint8)(TrigSource & ~(ADC_IPW_CTU_LOGICAL_ID_MASK_U16));
    uint8 UserId = Adc_GetUserID();

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_DISABLE_HW_TRIGGER_ID;

    if (Adc_ValidateCtuControlModeApi(CtuLogicalId, ServiceId, UserId) == (Std_ReturnType)E_OK)
    {
        if (TriggerId > ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
        {
            Adc_ReportDetError(ServiceId, ADC_E_WRONG_TRIGG_SRC);
        }
        else
        {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

            Adc_Ipw_CtuDisableHwTrigger(CtuLogicalId, (uint8)TriggerId, UserId);

#if (ADC_DEV_ERROR_DETECT == STD_ON)
        }
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
}

/** @implements      Adc_CtuStartConversion_Activity */
void Adc_CtuStartConversion(Adc_CtuTrigSrcType TrigSource)
{
    const uint8 CtuLogicalId = (uint8)((TrigSource & ADC_IPW_CTU_LOGICAL_ID_MASK_U16) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT_U16);
    const uint8 TriggerId = (uint8)(TrigSource & ~(ADC_IPW_CTU_LOGICAL_ID_MASK_U16));
    uint8 UserId = Adc_GetUserID();

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_START_CONVERSION_ID;

    if (Adc_ValidateCtuControlModeApi(CtuLogicalId, ServiceId, UserId) == (Std_ReturnType)E_OK)
    {
        if (TriggerId > ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
        {
            Adc_ReportDetError(ServiceId, ADC_E_WRONG_TRIGG_SRC);
        }
        else
        {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

            Adc_Ipw_CtuStartConversion(CtuLogicalId, (uint8)TriggerId, UserId);

#if (ADC_DEV_ERROR_DETECT == STD_ON)
        }
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
}

#if (ADC_IPW_CTU_AVAILABLE == STD_ON)
/** @implements      Adc_CtuMasterReload_Activity */
void Adc_CtuMasterReload(Adc_HwUnitType CtuUnit)
{
    uint8 UserId = Adc_GetUserID();
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_MASTER_RELOAD_ID;

    if (Adc_ValidateCtuControlModeApi(CtuUnit, ServiceId, UserId) == (Std_ReturnType)E_OK)
    {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

        Adc_Ipw_CtuMasterReload(CtuUnit, UserId);

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
}
#endif /* (ADC_IPW_CTU_AVAILABLE == STD_ON) */

#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
/** @implements      Adc_CtuReadConvData_Activity */
Adc_ValueGroupType Adc_CtuReadConvData(Adc_HwUnitType AdcUnit)
{
    uint8 UserId = Adc_GetUserID();
    Adc_ValueGroupType ConvData = 0u;
    Adc_HwUnitType AdcPhysicalId;

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_READ_CONV_DATA_ID;

    if (Adc_ValidateCtuControlModeApiByAdcUnit(AdcUnit, ServiceId, UserId) == (Std_ReturnType)E_OK)
    {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
        AdcPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[AdcUnit];
        ConvData = Adc_Ipw_CtuReadConvData(AdcPhysicalId);
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

    return ConvData;
}

/** @implements      Adc_CtuReadConvResult_Activity */
void Adc_CtuReadConvResult(Adc_HwUnitType AdcUnit,
                           Adc_CtuResultType * Result)
{
    uint8 UserId = Adc_GetUserID();
    Adc_HwUnitType AdcPhysicalId;

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_READ_CONV_RESULT_ID;

    if (Adc_ValidateCtuControlModeApiByAdcUnit(AdcUnit, ServiceId, UserId) == (Std_ReturnType)E_OK)
    {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
        AdcPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[AdcUnit];
        Adc_Ipw_CtuReadConvResult(AdcPhysicalId, Result);
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
}

/** @implements      Adc_CtuStopLoopConversions_Activity */
void Adc_CtuStopLoopConversions(Adc_CtuTrigSrcType TrigSource)
{
    const uint8 CtuLogicalId = (uint8)((TrigSource & ADC_IPW_CTU_LOGICAL_ID_MASK_U16) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT_U16);
    const uint8 TriggerId = (uint8)(TrigSource & ~(ADC_IPW_CTU_LOGICAL_ID_MASK_U16));

    uint8 UserId = Adc_GetUserID();
    uint32 CtuPhysicalId;

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_STOP_LOOP_CONVERSION_ID;
    if (Adc_ValidateCtuControlModeApi(CtuLogicalId, ServiceId, UserId) == (Std_ReturnType)E_OK)
    {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

        CtuPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuLogToPhyId[CtuLogicalId];

#if (ADC_DEV_ERROR_DETECT == STD_ON)
        if (TrigSource > ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
        {
            Adc_ReportDetError(ServiceId, ADC_E_WRONG_TRIGG_SRC);
        }
        else if (FALSE == Adc_ValidateTriggerLoopMode(UserId, CtuPhysicalId, TriggerId))
        {
            Adc_ReportDetError(ServiceId, ADC_E_INVALID_PARAM);
        }
        else
        {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
            Adc_Ipw_CtuStopLoopConversions(CtuPhysicalId, TriggerId);
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        }
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
}
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */

