rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc.c
/** @implements      Adc_CtuReadFifoData_Activity */
void Adc_CtuReadFifoData(Adc_CtuFifoIdxType FifoIdx,
                         uint16 * Data,
                         uint8 DataLength)
{
    uint8 Index;
    const uint8 CtuLogicalId = (uint8)((FifoIdx & ADC_IPW_CTU_LOGICAL_ID_MASK_U16) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT_U16);
    const uint8 FifoIndex = (uint8)(FifoIdx & ~(ADC_IPW_CTU_LOGICAL_ID_MASK_U16));
    uint8 UserId = Adc_GetUserID();

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_READ_FIFO_DATA_ID;
    if ((Std_ReturnType)E_OK == Adc_ValidateCtuControlModeApi(CtuLogicalId, ServiceId, UserId))
    {
        /* CPR_RTD_00471.adc */
        if ((Std_ReturnType)E_OK == Adc_ValidateCtuFifoParam(ServiceId, UserId, CtuLogicalId, FifoIndex, DataLength))
        {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
            for (Index = 0u; Index < DataLength; Index++)
            {
                Data[Index] = Adc_Ipw_CtuReadFifoData(CtuLogicalId, FifoIndex, UserId);
            }
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        }
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
}

/** @implements      Adc_CtuReadFifoResult_Activity */
void Adc_CtuReadFifoResult(Adc_CtuFifoIdxType FifoIdx,
                           Adc_CtuFifoResultType * Result,
                           uint8 ResultLength)
{
    uint8 Index;
    const uint8 CtuLogicalId = (uint8)((FifoIdx & ADC_IPW_CTU_LOGICAL_ID_MASK_U16) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT_U16);
    const uint8 FifoIndex = (uint8)(FifoIdx & ~(ADC_IPW_CTU_LOGICAL_ID_MASK_U16));
    uint8 UserId = Adc_GetUserID();

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_READ_FIFO_RESULT_ID;

    if ((Std_ReturnType)E_OK == Adc_ValidateCtuControlModeApi(CtuLogicalId, ServiceId, UserId))
    {
        /* CPR_RTD_00468.adc */
        if ((Std_ReturnType)E_OK == Adc_ValidateCtuFifoParam(ServiceId, UserId, CtuLogicalId, FifoIndex, ResultLength))
        {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
            for (Index = 0u; Index < ResultLength; Index++)
            {
                Adc_Ipw_CtuReadFifoResult(CtuLogicalId, FifoIndex, &(Result[Index]), UserId);
            }
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        }
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
}

/** @implements      Adc_CtuSetFifoWatermark_Activity */
void Adc_CtuSetFifoWatermark(Adc_CtuFifoIdxType FifoIdx,
                             uint8 Watermark)
{
    const uint8 CtuLogicalId = (uint8)((FifoIdx & ADC_IPW_CTU_LOGICAL_ID_MASK_U16) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT_U16);
    const uint8 FifoIndex = (uint8)(FifoIdx & ~(ADC_IPW_CTU_LOGICAL_ID_MASK_U16));
    uint8 UserId = Adc_GetUserID();

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_SET_FIFO_WATERMARK_ID;

    if (Adc_ValidateCtuControlModeApi(CtuLogicalId, ServiceId, UserId) == (Std_ReturnType)E_OK)
    {
        if (FifoIndex >= ADC_IPW_NUM_CTU_FIFO)
        {
            Adc_ReportDetError(ServiceId, ADC_E_WRONG_TRIGG_SRC);
        }
        else
        {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
            Adc_Ipw_CtuSetFifoWatermark(CtuLogicalId, FifoIndex, Watermark, UserId);
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        }
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
}

/** @implements      Adc_CtuEnableNotification_Activity */
void Adc_CtuEnableNotification(Adc_CtuNotificationType Notification)
{
    const uint8 CtuLogicalId = (uint8)((Notification & ADC_IPW_CTU_LOGICAL_ID_MASK) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT);
    uint8 UserId = Adc_GetUserID();
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_ENABLE_NOTIFICATION_ID;

    if (Adc_ValidateCtuControlModeApi(CtuLogicalId, ServiceId, UserId) == (Std_ReturnType)E_OK)
    {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
            Adc_Ipw_CtuEnableNotification(UserId, CtuLogicalId, Notification);
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
}

/** @implements      Adc_CtuDisableNotification_Activity */
void Adc_CtuDisableNotification(Adc_CtuNotificationType Notification)
{
    const uint8 CtuLogicalId = (uint8)((Notification & ADC_IPW_CTU_LOGICAL_ID_MASK) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT);
    uint8 UserId = Adc_GetUserID();
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_DISABLE_NOTIFICATION_ID;

    if (Adc_ValidateCtuControlModeApi(CtuLogicalId, ServiceId, UserId) == (Std_ReturnType)E_OK)
    {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
            Adc_Ipw_CtuDisableNotification(UserId, CtuLogicalId, Notification);
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
}

/** @implements      Adc_CtuSetList_Activity */
void Adc_CtuSetList(Adc_HwUnitType CtuUnit,
                    const Adc_CtuListItemType * const ListItemsArray,
                    const uint8 NumItems,
                    const uint8 ListStartPosition)
{
    uint8 UserId = Adc_GetUserID();
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_SET_LIST_ID;

    if (Adc_ValidateCtuControlModeApi(CtuUnit, ServiceId, UserId) == (Std_ReturnType)E_OK)
    {
        if (ListItemsArray == NULL_PTR)
        {
            Adc_ReportDetError(ServiceId, ADC_E_PARAM_POINTER);
        }
        else
        {
            if ((NumItems >= ADC_IPW_NUM_CTU_LIST_ELEMS) || (ListStartPosition >= ADC_IPW_NUM_CTU_LIST_ELEMS))
            {
                Adc_ReportDetError(ServiceId, ADC_E_WRONG_TRIGG_SRC);
            }
            else
            {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
                Adc_Ipw_CtuSetList(CtuUnit, ListStartPosition, ListItemsArray, NumItems, UserId);
#if (ADC_DEV_ERROR_DETECT == STD_ON)
            }
        }
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
}

/** @implements      Adc_CtuSetListPointer_Activity */
void Adc_CtuSetListPointer(Adc_CtuTrigSrcType TrigSource,
                           Adc_CtuListPtrType ListPtr)
{
    const uint8 CtuLogicalId = (uint8)((TrigSource & ADC_IPW_CTU_LOGICAL_ID_MASK_U16) >> ADC_IPW_CTU_LOGICAL_ID_SHIFT_U16);
    const uint8 TriggerId = (uint8)(TrigSource & ~(ADC_IPW_CTU_LOGICAL_ID_MASK_U16));
    uint8 UserId = Adc_GetUserID();
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const uint8 ServiceId = ADC_CTU_SET_LIST_POINTER_ID;

    if (Adc_ValidateCtuControlModeApi(CtuLogicalId, ServiceId, UserId) == (Std_ReturnType)E_OK)
    {
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
        Adc_Ipw_CtuSetListPointer(CtuLogicalId, TriggerId, ListPtr, UserId);
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    }
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
}
#endif /* ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON */

